immersive/rails/urdb/urdb-4/app/views/stars/show.html.haml

				%ul
					- @star.movies.each do |movie|
---
SELECT "movies".* FROM "movies" INNER JOIN "roles" ON "movies"."id" = "roles"."movie_id" WHERE "roles"."star_id" = ?  [["star_id", 1]]