immersive/rails/urdb/urdb-4/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = '500-days-of-summer' LIMIT 1
---
    def set_movie
      @movie = Movie.find_by_slug!(params[:id])