immersive/rails/urdb/urdb-4/app/controllers/stars_controller.rb

SELECT  "stars".* FROM "stars"  WHERE "stars"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@star = Star.find(params[:id])