immersive/rails/urdb/urdb-4/app/controllers/stars_controller.rb

SELECT  "stars".* FROM "stars"  WHERE "stars"."slug" = 'jim-carrey' LIMIT 1
---
	def show
		@star = Star.find_by_slug!(params[:id])

SELECT "stars".* FROM "stars"
---
	def index
		@stars = Star.all