immersive/rails/urdb/urdb-4/app/views/movies/show.html.haml

				%ul
					- @movie.roles.each do |role|
---
SELECT "roles".* FROM "roles"  WHERE "roles"."movie_id" = ?  [["movie_id", 1]]